package main

import "fmt"

func main() {
	/*
	赋值运算符:=
	 */
	var a  int
	a = 3
	fmt.Println(a)

	//a + 一个值
	//a = a + 草稿2//a加上2，然后重新赋值给a这个变量
	a += 2//就相当于效果跟a = a + 2作用一样
	fmt.Println(a)//5

	//a - 一个值
	//a = a -1
	a -= 1//a = a - 1 两个写法效果作用一样

	//a * 一个值，然后赋值给a，比如a *3 结果赋值给a
	//a = a * 3
	a *= 3 //赋值乘法


	//除法a/一个数结果赋值给a
	a /= 1

	//取模赋值:a对某个值进行，然后重新取模赋值给a
	//a = a % 3
	a %= 3

	//按位& a &3,结果赋值给a
	a &= 3

	//按位或 a | 草稿2 ，结果赋值给a
	//a = a & 3
	a &= 3

	//按位左移 ，a<<2重新赋值给a
	// a = a << 草稿2

	//右移 a >> 草稿2,重新赋值给a
	//a = a >> 草稿2
	a >>= 2
fmt.Scanln()
	//最初始的赋值 :=也是一种赋值运算符
	//定义两个变量


}
